# Задача «Последняя цифра числа»
# Условие
# Дано натуральное число. Выведите его последнюю цифру.
a = int(input('Введите число '))
print(a % 10)

# Задача «МКАД»
# Условие
# Длина Московской кольцевой автомобильной дороги —109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. На какой отметке он остановится через t часов?
#
# Программа получает на вход значение v и t. Если v>0, то Вася движется в положительном направлении по МКАД, если же значение v<0, то в отрицательном.
#
# Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.
#

# Условие
# Дано натуральное число. Выведите его последнюю цифру.
v = int(input('скорость '))
t = int(input('время '))
mkad_len = 109
print(abs( (v * t) % mkad_len))

# Задача «Дробная часть»
# Условие
# Дано положительное действительное число X. Выведите его дробную часть.

from decimal import Decimal
x = Decimal(input('Введите число '))
print(x - int(x))


# Задача «Первая цифра после точки»
# Условие
# Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.


x = float(input('Введите число '))
print(int(x * 10)% 10)

# Задача «Конец уроков»
# Условие
# В некоторой школе занятия начинаются в 9:00. Продолжительность урока — 45 минут, после 1-го, 3-го, 5-го и т.д. уроков перемена 5 минут, а после 2-го, 4-го, 6-го и т.д. — 15 минут.
#
# Дан номер урока (число от 1 до 10). Определите, когда заканчивается указанный урок.
#
# Выведите два целых числа: время окончания урока в часах и минутах.

n=int(input())-1
x=n//2*15+(n+n%2)//2*5+(n+1)*45
h=9
m=0
h=h+x//60
x=x %60
m=x
print(h,m)

# Задача «Автопробег»
# Условие
# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? Программа получает на вход числа n и m.
import math

n = int(input('Введите N '))
m = int(input('Введите M '))
print(math.ceil(m / n))


# Задача «Стоимость покупки»
# Условие
# Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков. Программа получает на вход три числа: a, b, n, и должна вывести два числа: стоимость покупки в рублях и копейках.
from decimal import Decimal
a = int(input('Введите рубли '))
b = int(input('Введите копейки '))
n = int(input('Введите пирожки '))
result = ((a * 100 + b) * n / 100)
print(int(result),  int(round(result - int(result), 2) * 100) )


# Задача «Разность времен»
# Условие
# Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени. Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.
#
# Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.
#
# Выведите число секунд между этими моментами времени.
#

a = int(input())
b = int(input())
c = int(input())
a1 = int(input())
b1 = int(input())
c1 = int(input())
time1 =  (a * 3600) + (b * 60) + c
time2 = (a1 * 3600) + (b1 * 60) + c1
result = time2 - time1
print(result)

# Задача «Улитка»
# Условие
# Улитка ползет по вертикальному шесту высотой h метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. На какой день улитка доползет до вершины шеста?
#
# Программа получает на вход натуральные числа h, a, b.
#
# Программа должна вывести одно натуральное число. Гарантируется, что a>b.

import math
h = int(input())
a = int(input())
b = int(input())

result = (h - a) / (a - b) + 1
print(int(math.ceil(result)))

# Занятие 3. Вычисления
# Задача «Число десятков»
# Условие

# Дано натуральное число. Найдите число десятков в его десятичной записи.

a = int(input())
b = a % 100
print(b // 10)

# Задача «Сумма цифр»
# Условие
# Дано трехзначное число. Найдите сумму его цифр.

a = str(input())
print(int(a[0]) + int(a[1])  + int(a[2]))


# Занятие 3. Вычисления
# Задача «Гипотенуза»
# Условие
# Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.
import math
a = int(input())
b = int(input())
print(math.sqrt((a * a) + (b * b)))


# Занятие 3. Вычисления
# Задача «Проценты»
# Условие
# Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада. Вклад составляет X рублей Y копеек. Определите размер вклада через год.
# Программа получает на вход целые числа P, X, Y и должна вывести два числа: величину вклада через год в рублях и копейках. Дробная часть копеек отбрасывается.


p = int(input())
x = int(input())
y = int(input())
deposit = (x + y / 100) * (1+ p/100)
rub = int(deposit)
kop = int(100 * (float('%.2f' % (deposit - int(deposit)))))
print(rub, kop)







