# Минимум из двух чисел

# Условие
# Даны два целых числа. Выведите значение наименьшего из них.

a = int(input("Первое число "))
b = int(input("второе число "))
if a < b:
    print(f'{a} меньше')
else:
    print(f'{b} меньше')


# Знак числа

# Условие
# В математике функция sign(x) (знак числа) определена так:
# sign(x) = 1, если x > 0,
# sign(x) = -1, если x < 0,
# sign(x) = 0, если x = 0.
# Для данного числа x выведите значение sign(x). Эту задачу желательно решить с использованием каскадных инструкций if... elif... else.

a = int(input('Введите число '))
if a > 0:
    print('1')
elif a == 0:
    print('0')
else:
    print('-1')



#Задача «Шахматная доска»
# Условие
# Заданы две клетки шахматной доски. Если они покрашены в один цвет, то выведите слово YES, а если в разные цвета — то NO. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

a = int(input('Введите первое число ')) % 2
b = int(input('Введите второе число ')) % 2
c = int(input('Введите третье число ')) % 2
d = int(input('Введите четвертое число ')) % 2
if a == b and c == d:
    print('yes')
elif a == c and b == d:
    print('yes')
elif a != b and c != d:
    print('yes')
else:
    print('no')

#Задача «Високосный год»
# Условие
# Дано натуральное число. Требуется определить, является ли год с данным номером високосным. Если год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.


year = int(input("Введите год "))

if not year % 4 and year % 100 or not year % 400:
    print('Yes')
else:
    print('NO')
# Задача «Минимум из трех чисел»
# Условие
# Даны три целых числа. Выведите значение наименьшего из них.
a = int(input('Первое '))
b = int(input('Второе '))
c = int(input('Третие '))

if a <= b and a <= c:
    print(a)
elif b <= a and b <= c:
    print(b)
else:
    print(c)

#Задача «Сколько совпадает чисел»
# Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).
a = int(input('Первое '))
b = int(input('Второе '))
c = int(input('Третие '))

if a == b == c:
    print('3')
elif a == b or a == c or b == c:
    print('2')
else:
    print('0')

#Задача «Ход ладьи»
# Условие
# Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, может ли ладья попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в противном случае.
a = int(input('Введите первое число '))
b = int(input('Введите второе число '))
c = int(input('Введите третье число '))
d = int(input('Введите четвертое число '))
if a == c or b == d:
    print('yes')
else:
    print('no')



# Задача «Ход короля»
# Условие
# Шахматный король ходит по горизонтали, вертикали и диагонали, но только на 1 клетку. Даны две различные клетки шахматной доски, определите, может ли король попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES, если из первой клетки ходом короля можно попасть во вторую или NO в противном случае.

a = int(input('Введите первое число '))
b = int(input('Введите второе число '))
c = int(input('Введите третье число '))
d = int(input('Введите четвертое число '))
if a == c + 1 and b == d or a == c - 1 and b == d:
    print('yes')
elif b == d + 1 and a == c or b == d - 1 and a == c:
    print('yes')
elif a == c + 1 and b == d + 1 or a == c - 1 and b == d - 1:
    print('yes')
elif a == c + 1 and b == d - 1 or a == c - 1 and b == d + 1:
    print('yes')
else:
    print('no')

# Задача «Ход слона»
# Условие
# Шахматный слон ходит по диагонали. Даны две различные клетки шахматной доски, определите, может ли слон попасть с первой клетки на вторую одним ходом.

a = int(input('Введите первое число '))
b = int(input('Введите второе число '))
c = int(input('Введите третье число '))
d = int(input('Введите четвертое число '))
if a % 2 == b % 2 and c % 2 == d % 2:
    print('yes')
elif a % 2 == c % 2 and b % 2 == d % 2:
    print('yes')
elif a % 2 != b % 2 and c % 2 != d % 2:
    print('yes')
else:
    print('no')
