# Занятие 4. Цикл for
# Задача «Ряд - 1»
# Условие
# Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

a = int(input('A '))
b = int(input('B '))
if a <= b:
    for i in range(a, b + 1):
        print(i)
else:
    for i in range(a, b - 1, -1):
        print(i)

# Занятие 4. Цикл for
# Задача «Ряд - 2»
# Условие
# Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

a = int(input('A '))
b = int(input('B '))
if a <= b:
    for i in range(a, b + 1):
        print(i)
else:
    for i in range(a, b - 1, -1):
        print(i)

# Занятие 4. Цикл for
# Задача «Ряд - 3»
# Условие
# Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B включительно, в порядке убывания. В этой задаче можно обойтись без инструкции if.



a = int(input())
b = int(input())
for i in reversed(range(b|1, a+1, 2)):
    print(i)


# Задача «Сумма десяти чисел»
# Условие
# Дано 10 целых чисел. Вычислите их сумму. Напишите программу, использующую наименьшее число переменных.
result = 0
for i  in range(1, 11):
    result += int(input())
print(result)

# Занятие 4. Цикл for
# Задача «Сумма N чисел»
# Условие
# Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел. Какое наименьшее число переменных нужно для решения этой задачи?


n = int(input('count'))
result = 0
for i  in range(1, n + 1):
    result += int(input())
print(result)


# Занятие 4. Цикл for
# Задача «Сумма кубов»
# Условие
# По данному натуральному n вычислите сумму 13+23+33+...+n3.

# Занятие 4. Цикл for
# Задача «Сумма кубов»
# Условие
# По данному натуральному n вычислите сумму 13+23+33+...+n3.

n = int(input('кубы '))
result = 0
for i  in range(1, n + 1):
    result += i ** 3
print(result)


# Занятие 4. Цикл for
# Задача «Факториал»
# Условие
# Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
# По данному натуральному n вычислите значение n!. Пользоваться математической библиотекой math в этой задаче запрещено.


n = int(input('число'))
result = 1
for i  in range(1, n + 1):
    result *= i
print(result)

# Занятие 4. Цикл for
# Задача «Сумма факториалов»
# Условие
# По данному натуральном n вычислите сумму 1!+2!+3!+...+n!. В решении этой задачи можно использовать только один цикл. Пользоваться математической библиотекой math в этой задаче запрещено.

n = int(input('число '))
result = 1
fc = 1
for i in range(2, n + 1):
    fc = fc * i
    result += fc
print(result)

#1*1+1*2+1*2*3 = 9


# Занятие 4. Цикл for
# Задача «Количество нулей»
#
#
n = int(input('count'))
result = 0
input_value = 0
for i in range(1, n + 1):
    input_value = int(input())
    if input_value == 0:
        result += 1
print(result)


# Занятие 4. Цикл for
# Задача «Лесенка»
# Условие
# По данному натуральному n ≤ 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от 1 до i без пробелов.

n = int(input('count'))
result = str()
for i in range(1, n + 1):
        result += str(i)
        print(result)

# Занятие 4. Цикл for
# Задача «Потерянная карточка»
# Условие
# Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.
# Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки.
#
# Для самых умных: массивами и аналогичными структурами данных пользоваться нельзя.

n = int(input('count '))
result = 0
input_value = 0
for i in range(1, n):
    input_value += int(input())
for key in range(1, n + 1):
    result += key
print(result - input_value)

